app/controllers/session_controller.rb

  def create
    user = User.find_by_email(params[:emails])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]