app/controllers/users_controller.rb

  def show
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    user = User.new(user_params)
      user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", ""], ["email", ""], ["password_digest", ""], ["created_at", "2018-02-28 11:08:29.616760"], ["updated_at", "2018-02-28 11:08:29.616760"]]